{
  "header": {
    "home": "Início",
    "technologies": "Tecnologias",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "see-project": "Ver projeto",
  "hello": "Olá, eu sou",
  "front-end-developer": "Desenvolvedor front-end",
  "about-me": "Engenheiro civil de graduação, desenvolvo web-sites modernos, concentrados em performance, responsividade, animações e SEO.",
  "techs": "Tecnologias",
  "projects": "Projetos",
  "projects_description": [
    "A aplicação permite o usuário fazer um pedido de diversos restaurantes, podendo filtrar restaurantes de acordo com suas restrições alimentares até finalizar o seu pedido.",
    "É uma aplicação desenvolvida para o usuário gerenciar as tecnologias aprendidas e os projetos criados.",
    "É uma aplicação de página única de um e-commerce, o qual possui uma vitrine com produtos com botões de adicionar ao carrinho, um carrinho de compras e uma barra de filtros, um campo de pesquisa.",
    "É uma plataforma de controle de gastos, onde é possível registrar uma descrição, um valor e o tipo desse valor (entrada ou saída).",
    "A ideia desse projeto é simular uma comunidade, onde todos os membros cadastrados podem consumir, criar, atualizar e deletar publicações de texto. Foi desenvolvido utilizando Programação Orientada a Objetos.",
    "É uma aplicação de página única de um e-commerce, o qual possui uma vitrine com produtos com botões de adicionar ao carrinho, um carrinho de compras,uma barra de filtros e um campo de pesquisa",
    "Baseado no jogo The Oregon Trail, é uma aplicação em que o usuário monta sua própria carroça, escolhe quantos vagões ela terá , e nela consegue adicionar três tipos de viajantes. Cada viajante possui ações específicas, podendo ser a de caçar comida, comer e/ou curar. Desenvolvido utilizando Programação Orientada a Objetos."
  ],
  "contact": {
    "title": "Contato",
    "description": "Eu estou interessado em oportunidades projetos freelance e oportunidades de emprego. Mas se você tiver qualquer questão ou dúvida, pode me mandar mensagem!",
    "label-name": "Nome",
    "label-subject": "Assunto",
    "label-message": "Mensagem"
  }
}
